 [
     {
         "item": "PDB Identifier(s)",
         "id": "pdb_id",
         "example": "1jgg",
         "description": "PDB identifiers are unique, four character identifiers that the Protein Data Bank assigns to every deposited structure. They always begin with a digit from 1-9 and only contain alphanumeric characters. Not case sensitive."
    },
     {
         "item": "Protein Features",
         "id": "protein_features",
         "description": "Features which are specific to the protein in the structure.",
         "sub-items": [
             {
                 "item": "Chain Features",
                 "id": "chain_features",
                 "description": "Features that describe or are related to a protein chain. Several annotations are derived from other databases (when available) such as <a href='http://www.cathdb.info/'>CATH</a>, <a href='https://www.uniprot.org/'>UniProt</a> and the <a href='http://geneontology.org'>Gene Ontology Knowledgebase</a>.",
                 "sub-items": [{
                     "item": "Sequence Similarity",
                     "id": "protein_seq_similarity",
                     "description": "Matches protein chains which share a specified sequence similarity (30-100%) with a particular chain in a particular PDB structure. These matches are based on the PDB sequence clusters which are available at <a href='ftp://resources.rcsb.org/sequence/clusters'>ftp://resources.rcsb.org/sequence/clusters</a>",
                     "example": "The structure 1R05 contains two protein chains of the Max transcription factor homodimer with no DNA. To find structures which contain protein chains with a 90% sequence similarity to chain 'A' in this structure, you would specify '90%' under the sequence similarity drop down, '1R05' in the PDB ID input, and 'A' in the chain ID input."
             }, {
                     "item": "UniProt ID",
                     "id": "protein_uniprot",
                     "description": "Matches proteins chains which contain sequences identifiable with a <a href='https://www.uniprot.org/'>UniProt</a> ID for that sequence.",
                     "example": "P61244"
             }, {
                     "item": "CATH Identifier",
                     "id": "protein_cath_id",
                     "description": "Matches protein chains which contain a specified CATH domain. This can be at the level of class, architecture, topology or homologous super family. See the <a href='http://www.cathdb.info/'>CATH</a> database for more information.",
                     "example": "4.10.280.10, 4.10.280, 4.10, or 4 are all valid cath IDs, specifying different levels of the CATH classification hierarchy."
                 }, {
                     "item": "GO Term",
                     "id": "protein_go_term",
                     "description": "Matches protein chains which are annotated with a particular GO term. The user can include a term from any of the three GO domains - molecular function, biological process or cellular component. See the <a href='http://geneontology.org/docs/ontology-documentation/'>Gene Ontology</a> documentation for more information.",
                     "example": "The GO term <a href='https://www.ebi.ac.uk/QuickGO/term/GO:0003697'>0003697</a> refers to the molecular function 'single-stranded DNA binding'. Including this term will match protein chains which have known ssDNA binding function."
                 }, {
                     "item": "Chain Length",
                     "id": "protein_chain_length",
                     "description": "Specify a range for the total length of the matching protein chain.",
                     "example": "min: 100; max:500"
                 }, {
                     "item": "interacts with DNA",
                     "id": "protein_interacts_dna",
                     "description": "Checking will ensure that any matching chains are interacting with a DNA entity in the returned structure."
             }]
         }
    ]
     },
     {
         "item": "DNA Features",
         "id": "dna_features",
         "description": "Features which describe the DNA in the structure. These are features which can be calculated or obtained without any knowledge of the protein structure.",
         "sub-items": [
             {
                 "item": "Structure Features",
                 "id": "dna_structure_features",
                 "description": "Features which are structure-level, meaning one level above <a href='/cgi-bin/glossary?id=dna_entities#dna_entities'>DNA entities</a>. These may vary across each <a href='/cgi-bin/glossary?id=model#model'>model</a> in the structure.",
                 "sub-items": [
                     {
                         "item": "Number of DNA Entities",
                         "id": "dna_entity_count",
                         "description": "Matches structures where at least one model has a number of <a href='/cgi-bin/glossary?id=dna_entities#dna_entities'>DNA entities</a> within the specified range.",
                         "example": "Setting max: 1 will eliminate any structure with multiple DNA entities."
                    }
                 ]
             },
             {
                 "item": "DNA Entity Features",
                 "id": "dna_entity_features",
                 "description": "Features which are at the <a href='/cgi-bin/glossary?id=dna_entities#dna_entities'>DNA entity</a> level.",
                 "sub-items": [
                     {
                         "item": "Number of Strands",
                         "id": "dna_strand_count",
                         "example": "min: 2; max: 4",
                         "description": "Matches structures with at least one DNA entity where the number of strands composing the entity is within the specified range."
                    }, {
                         "item": "Number of Helices",
                         "id": "dna_helix_count",
                         "example": "min: 1; max: 1",
                         "description": "Matches structures where at least one DNA entity contains a number of helices within the specified range. Note that helices refer to double-helices. Triple and Quadruple stranded helices are not included."
                    }, {
                         "item": "DNA Entity Type",
                         "id": "dna_entity_type",
                         "example": "selecting 'ssDNA' will match structures where at least one DNA entity is single-stranded.",
                         "description": "DNAproDB classifies <a href='/cgi-bin/glossary?id=dna_entities#dna_entities'>DNA entities</a> at the level of secondary structure based on the base-pairing within the entity. Entity types include helical, single-stranded, helix/single-stranded or other."
                    },
                     {
                         "item": "Chemical Modifications",
                         "id": "dna_chemical_modifications",
                         "description": "Matches DNA entities that contain at least one chemically modified nucleotide of the selected type."
                    }
                 ]
             },
             {
                 "item": "Strand Features",
                 "id": "dna_strand_features",
                 "description": "Features of <a href='/cgi-bin/glossary?id=dna_strand#dna_strand'>DNA strands</a>. These are mainly related to the sequence within each strand.",
                 "sub-items": [{
                         "item": "Strand Length",
                         "id": "dna_seq_length",
                         "example": "min: 10; max: 40",
                         "description": "The number of nucleotides in the DNA strand. Matches structures which contain at least one strand with sequence length within the specified range. If min or max is left unspecified, then the sequence length has no lower or upper bound respectively."
                },
                     {
                         "item": "Sequence Motif",
                         "id": "dna_seq_motif",
                         "example": "TATAWW, TAATAWW",
                         "description": "Matches structures where at least one DNA strand contains the specified motif. Valid characters include the <a href='http://www.bioinformatics.org/sms/iupac.html'/>IUPAC nucleic acid notation alphabet.</a> Selecting 'does not contain motif' will match structures for which no strand contains the specified motif. You can include multiple motifs by separating each with a comma or space."
                },
                     {
                         "item": "GC Content",
                         "id": "dna_seq_gc_content",
                         "example": "min: 0.75; will return GC-rich sequences.",
                         "description": "Matches structures where the DNA sequence GC content for at least ones strand falls within the specified range. If min(max) is left unspecified, then the lower(upper) bound is set to 0(1)."
                },
                     {
                         "item": "strands are protein bound",
                         "id": "dna_interacts_protein",
                         "description": "Checking will ensure that any matching strands are interacting with a protein entity in the returned structure."
             }]
            },
             {
                 "item": "Helix Features",
                 "id": "dna_helix_features",
                 "description": "Features of DNA helices within a DNA entity. Here helices refer to double-helices, triple and quadruple helices are not explicitly identified currently by DNAproDB. Note that for structures that do not contain any DNA helices, these features will be ignored. To ensure the structure contains at least one helix, use the 'Number of Helices' option under 'DNA Entity-level Features'.",
                 "sub-items": [
                     {
                         "item": "Helical Axis Curvature",
                         "id": "helical_axis_curvature",
                         "description": "Matches structures where at least one DNA helix within the structure has a helical axis curvature corresponding to one of the selected options."
                    },
                     {
                         "item": "Helical Conformation",
                         "id": "helical_conformation",
                         "description": "Matches structures where at least one DNA helix within the structure has a helical conformation corresponding to one of the selected options."
                    },
                     {
                         "item": "Base Pairing",
                         "id": "helical_base_pairing",
                         "description": "Matches structures where at least one DNA helix within the structure has at least one of the specified non-Watson-Crick base pairs."
                    }]
             }

     ]
    },
     {
         "item": "DNA-Protein Interaction Features",
         "id": "interactions",
         "description": "Features which describe the DNA-protein interactions in the structure.",
         "sub-items": [
             {
                 "item": "DNA-Protein Interface Features",
                 "id": "interface_features",
                 "description": "Features related to global properties of a DNA-protein interface in the structure. These are statistics over all nucleotide-residue interactions or descriptions of the protein interface surface region.",
                 "sub-items": [{
                         "item": "Major Groove Interactions",
                         "id": "major_groove_contacts",
                         "description": "Matches structures where the selected secondary structure element types contact the DNA in the major groove for at least one DNA-protein interface present in the structure. When choosing multiple secondary structure interactions, you may choose to match on interfaces which have all interactions present, or those with any of them present. Selecting 'negate selection' will match structures at least one interface does NOT have the selected interactions.",
                         "example": "Selecting 'helix' and 'strand' and matching on 'all' will select interfaces that have BOTH helices and strands interacting with the DNA major groove. Negating the selection will match interfaces that have do NOT have BOTH helices and strands interacting with the DNA major groove, but will match interfaces that have one or the other, or neither."
                },
                     {
                         "item": "Minor Groove Interactions",
                         "id": "minor_groove_contacts",
                         "description": "Matches structures where the selected secondary structure element types contact the DNA in the minor groove for at least one DNA-protein interface present in the structure. When choosing multiple secondary structure interactions, you may choose to match on interfaces which have all interactions present, or those with any of them present. Selecting 'negate selection' will match structures at least one interface does NOT have the selected interactions.",
                         "example": "Selecting 'helix' and 'strand' and matching on 'all' will select interfaces that have BOTH helices and strands interacting with the DNA minor groove. Negating the selection will match interfaces that have do NOT have BOTH helices and strands interacting with the DNA minor groove, but will match interfaces that have one or the other, or neither."
                },
                     {
                         "item": "Sugar Interactions",
                         "id": "sugar_contacts",
                         "description": "Matches structures where the selected secondary structure element types contact the DNA in the sugar for at least one DNA-protein interface present in the structure. When choosing multiple secondary structure interactions, you may choose to match on interfaces which have all interactions present, or those with any of them present. Selecting 'negate selection' will match structures at least one interface does NOT have the selected interactions.",
                         "example": "Selecting 'helix' and 'strand' and matching on 'all' will select interfaces that have BOTH helices and strands interacting with the DNA sugar. Negating the selection will match interfaces that have do NOT have BOTH helices and strands interacting with the DNA sugar, but will match interfaces that have one or the other, or neither."
                },
                     {
                         "item": "Phosphate Interactions",
                         "id": "phosphate_contacts",
                         "description": "Matches structures where the selected secondary structure element types contact the DNA in the phosphate for at least one DNA-protein interface present in the structure. When choosing multiple secondary structure interactions, you may choose to match on interfaces which have all interactions present, or those with any of them present. Selecting 'negate selection' will match structures at least one interface does NOT have the selected interactions.",
                         "example": "Selecting 'helix' and 'strand' and matching on 'all' will select interfaces that have BOTH helices and strands interacting with the DNA phosphate. Negating the selection will match interfaces that have do NOT have BOTH helices and strands interacting with the DNA phosphate, but will match interfaces that have one or the other, or neither."
                },
                     {
                         "item": "Base Interactions",
                         "id": "base_contacts",
                         "description": "Matches structures where the selected secondary structure element types contact the DNA in the base for at least one DNA-protein interface present in the structure. When choosing multiple secondary structure interactions, you may choose to match on interfaces which have all interactions present, or those with any of them present. Selecting 'negate selection' will match structures at least one interface does NOT have the selected interactions.",
                         "example": "Selecting 'helix' and 'strand' and matching on 'all' will select interfaces that have BOTH helices and strands interacting with the DNA base. Negating the selection will match interfaces that have do NOT have BOTH helices and strands interacting with the DNA base, but will match interfaces that have one or the other, or neither."
                },
                     {
                         "item": "Secondary Structure Composition",
                         "id": "ss_composition",
                         "description": "Matches structures where the overall secondary structure composition of at least one interface matches the selected values. Secondary structure composition is calculated based on buried solvent accessible surface area (BASA)."
                },
                     {
                         "item": "Residue Propensities",
                         "id": "propensities",
                         "description": "Matches structures where the selected residues match the selected propensity thresholds in at least one interface. Propensity measures how common a residue is in the DNA-protein interface relative to the rest of the solvent exposed protein surface. Enhanced residues are more common in the interface relative to the rest of the protein surface, and depleted residues are less common in the interface relative to the protein surface."
                }]
    },
             {
                 "item": "Nucleotide-Residue Interaction Features",
                 "id": "nuc-res_interactions",
                 "description": "Features related to individual Nucleotide-Residue interactions in the structure. Matches structures which have at least one nucleotide-residue interaction which meets the specified criteria.",
                 "sub-items": [{
                         "item": "Nucleotide Base(s)",
                         "id": "nuc_name",
                         "description": "Select the name of a nucleotide which should be involved in the pair-wise interaction. If left blank, any nucleotide will match. Multiple selections will match any of the selected values."
                },
                     {
                         "item": "Protein Residue(s)",
                         "id": "res_name",
                         "description": "Select the name of a residue which should be involved in the pair-wise interaction. If left blank, any residue will match. Multiple selections will match any of the selected values."
                },
                     {
                         "item": "Residue Secondary Structure",
                         "id": "res_ss",
                         "description": "The secondary structure conformation of the residue involved in the interaction. DNAproDB uses three secondary structure types - helix, strand and loop."
                },
                     {
                         "item": "Interaction Geometry",
                         "id": "interaction_geometry",
                         "description": "For residues with planar side-chains (arg, phe, tyr, trp, his, asn, asp, gln, glu), a nucleotide-residue interaction can be identified as potentially being in a stacking-orientation (pseudo-stacking) or a pair-like orientation (pseudo-stacking), otherwise the geometry is 'none'. These geometries are identified using the program  <a href='http://forum.x3dna.org/dna-protein-interactions/snap-software-for-characterizing-dna-protein-interactions/'>SNAP</a> by Xiang-Jun Lu."
                },
                     {
                         "item": "Interaction Moiety",
                         "id": "interaction_moiety",
                         "description": "Which DNA moiety the interaction takes place involves, determined by a combination of BASA, hydrogen bonds and atomic distances. DNA moiety depends on the secondary structure of the interacting nucleotide - for example, major and minor groove moieties will only occur for helical DNA."
                },
                     {
                         "item": "Hydrogen Bonds",
                         "id": "interaction_hbonds",
                         "description": "Matches interactions where there is at least one hydrogen bond between the residue and nucleotide in the involving the specified DNA moiety."
                }]
    }]
    },
     {
         "item": "Model",
         "id": "model",
         "description": "A model is one possible structure in an ensemble of structures that are possible for a given set of residues/nucleotides. A model is defined by the assignment of atomic coordinates to each atom within the model. Multiple model entries usually occur for NMR structures, where as structures obtained through X-ray diffraction will usually only have a single model. Any quantity which is derived from the three-dimensional coordinates of the residues/nucleotides may vary across models. This includes protein secondary structure, nucleotide base-pairing, and nucleotide-residue interactions."
    },
     {
         "item": "DNA Strand",
         "id": "dna_strand",
         "description": "A DNA strand is any number of nucleotides which create a polymeric chain via phosphodiester bonds. Ideally, a DNA chain would correspond to exactly one strand, however often chain breaks occur and a chain may contain multiple strands. Strands are model-dependent and different models may have different strands depending on how much the nucleotide coordinates vary."
    },

     {
         "item": "DNA Structural Entity",
         "id": "dna_entities",
         "example": "C1@D1 - a typical DNA entity identifier for an entity composed of strands C1 and D1.",
         "description": "A DNA structural entity is a collection of DNA strands which are connected via base pairing or base-stacking interactions to form a connected sub-component of the structure. Often a structure will only have a single DNA entity, but some structures may have many. Multiple DNA entities may be caused by missing nucleotides, incorrect biological assembly, or may be a genuine feature of the relevant biological structure. An entity identifier is simply a concatenation of the strand identifiers which compose the entity. DNAproDB defines interfaces at the level of DNA entities and protein entities - one interface per interacting DNA entity-protein entity pair."
    },
     {
         "item": "Protein Chain Segments",
         "id": "protein_chain_segments",
         "description": "A protein chain segment is a continuous stretch of a protein chain which does not contain any chain breaks. If a chain has multiple breaks, then each break will correspond to two chain segments. Chain breaks generally occur when residues are missing or are incomplete."
    },
     {
         "item": "Protein Structural Entity",
         "id": "protein_entities",
         "description": "A protein structural entity is a collection of protein chain segments which are in contact with one another to form a connected sub-component of the structure. A protein entity may consist of multiple protein chains, and will usually form a biologically relevant complex, such as a heterodimer. DNAproDB defines interfaces at the level of DNA entities and protein entities - one interface per interacting DNA entity-protein entity pair."
    },
     {
         "item": "DNA Moieties",
         "id": "dna_moieties",
         "description": "A DNA moiety is a structural sub-component of a nucleotide, which depends on the secondary structure. For double-stranded helices, a nucleotide has a phosphate moiety, sugar moiety, and a major and minor groove moiety. Single-stranded DNA obviously does not have a major or minor groove, therefore the entire base is treated as a moiety. DNAproDB identifies nucleotide-residue interactions by which moieties are interacting. For example, a side-chain-minor groove interaction. When visualization these interactions, you can choose which DNA moiety interactions are displayed."
    },
     {
         "item": "Secondary Structure Element (SSE) Types",
         "id": "sse_types",
         "description": "DNAproDB uses three classes to describe protein secondary structure. The two basic types are Helices and Strands - everything else is considered a loop. Note that distinctions between different helix types are not made. When visualizing an interface, you may filter residues by their secondary structure type using the advanced interaction options."
    },
     {
         "item": "SSE Marker Size",
         "id": "marker_represents",
         "description": "You may choose what the size (e.g. area) of each marker that corresponds to a SSE represents. By default, the area represents the BASA of the SSE for the selected grooves, (i.e. the BASA due to contact with the DNA major groove), but you may instead wish to represent hydrogen bond count, residue count, or the number of nucleotide interactions."
    },
     {
         "item": "Weak Interaction",
         "id": "weak_interactions",
         "description": "A nucleotide-residue interaction is considered 'weak' if it meets the threshold of an interaction (minimum distance < 4.5 angstroms), but the interactions features are weak relative to all other nucleotide-residue interactions of the same type. The features considered include the number of hydrogen bonds, the buried accessible surface area, and number of van der waals interactions. By default weak interactions are excluded from visualizations."
    },
     {
         "item": "Category Search Logic",
         "id": "category_logic",
         "description": "This input allows you to choose how to combine different features within a specific category. By selecting 'ALL', then only structures which match all selected features within a category will be shown. If you choose 'ANY', then structures which match any feature option will be shown.",
         "example": "Suppose we are looking at DNA features and we choose a sequence motif 'TATAA' and choose that the DNA entity type should be helical. If we select to match on 'ALL' then only structures which contain a helical entity where at least one strand matches the 'TATAA' motif will be returned. If we choose 'ANY', then any structures which contains either a helical entity OR a strand which contains the motif 'TATAA' will be returned."
    },
     {
         "item": "Interaction Criteria",
         "id": "interaction_criteria",
         "description": "You may apply custom cut-off values of various criteria to use for deciding which interactions to draw. A nucleotide-residue or nucleotide-sse interaction will be included only if it meets any of the cut-offs chosen. To ignore a criteria, set it to zero. ",
         "sub-items": [
             {
                 "item": "BASA",
                 "id": "interaction_basa",
                 "description": "BASA stands for Buried solvent Accessible Surface Area and represents the sum of the area of the solvent accessible surface of a residue and nucleotide which is lost during an interaction. BASA can be broken down into components by DNA moiety, and these components are used to identify interactions in the DNA major groove, minor groove, base, sugar or phosphate."
            },
             {
                 "item": "Hbonds",
                 "id": "interaction_hbonds",
                 "description": "The number of hydrogen bonds between a residue and a nucleotide for a given moiety."
            },
             {
                 "item": "vdW Interactions",
                 "id": "interaction_vdw",
                 "description": "The number of van der Waal interactions between a residue and a nucleotide for a given moiety."
            }
        ]
    }
 ]